dump/travelguru/tg_hotel_detail_request.xml


        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> 
        <soap:Body> <OTA_HotelAvailRQ xmlns="http://www.opentravel.org/OTA/2003/05" RequestedCurrency="INR" SearchCacheLevel="Live" CorrelationID="T199V222931099425307077331050305561683"> 
        <AvailRequestSegments> 
           <AvailRequestSegment> 
               <HotelSearchCriteria> 
                   <Criterion> 
                       <HotelRef HotelCode="00020702"/> 
                       <StayDateRange End="2019-12-25" Start="2019-12-24"/> 
                       <RoomStayCandidates>
        <RoomStayCandidate> 
            <GuestCounts> 
                <GuestCount AgeQualifyingCode="10"/>
                    <GuestCount Age="5" AgeQualifyingCode="8"/>
                        <GuestCount Age="3" AgeQualifyingCode="8"/>
                                   	</GuestCounts>                                     
            </RoomStayCandidate></RoomStayCandidates> 
                        <TPA_Extensions SeoEnabled="false"> 
                        <Pagination hotelsFrom="0" hotelsTo="0"/> 
                        <UserAuthentication password="test@123" propertyId="1000000002" username="testsell"/> 
                           </TPA_Extensions> 
                       </Criterion> 
                   </HotelSearchCriteria> 
               </AvailRequestSegment> 
           </AvailRequestSegments> 
           </OTA_HotelAvailRQ> 
       </soap:Body> </soap:Envelope>